[Killed] BlockStatement
src/components/Title/index.tsx:6:21
 import {View} from 'react-native';
 import {Text} from './styles';
 
-const Title = () => {
-  const [textSize, setTextSize] = useState('10px');
-
-  useEffect(() => {
-    setTimeout(() => {
-      setTextSize('15px');
-    }, 450);
-  }, []);
-
-  return (
-    <View>
-      <Text testID="title-component" textSize={textSize}>
-        A Title
-      </Text>
-    </View>
-  );
-};
+const Title = () => {};
 
 export default Title;
killedBy: All tests
statusReason: > strykerAsyncApp@0.0.1 test
> jest --maxWorkers=50%



react-native/jest/preprocessor.js is deprecated and will be removed.
Use "preset": "react-native" in your Jest config instead.
See https://jestjs.io/docs/tutorial-react-native for more setup instructions.

[Killed] BlockStatement
src/components/Title/index.tsx:9:19
 const Title = () => {
   const [textSize, setTextSize] = useState('10px');
 
-  useEffect(() => {
-    setTimeout(() => {
-      setTextSize('15px');
-    }, 450);
-  }, []);
+  useEffect(() => {}, []);
 
   return (
killedBy: All tests
statusReason: > strykerAsyncApp@0.0.1 test
> jest --maxWorkers=50%



react-native/jest/preprocessor.js is deprecated and will be removed.
Use "preset": "react-native" in your Jest config instead.
See https://jestjs.io/docs/tutorial-react-native for more setup instructions.

[Killed] BlockStatement
src/components/Title/index.tsx:10:22
   const [textSize, setTextSize] = useState('10px');
 
   useEffect(() => {
-    setTimeout(() => {
-      setTextSize('15px');
-    }, 450);
+    setTimeout(() => {}, 450);
   }, []);
 
killedBy: All tests
statusReason: > strykerAsyncApp@0.0.1 test
> jest --maxWorkers=50%



react-native/jest/preprocessor.js is deprecated and will be removed.
Use "preset": "react-native" in your Jest config instead.
See https://jestjs.io/docs/tutorial-react-native for more setup instructions.
