[Killed] ArrowFunction
src/components/Title/styles.ts:8:5
 };
 
 export const Text = styled.Text<TextProps>`
-  ${({textSize}) => css`
-    font-size: ${textSize};
-  `}
+  ${() => undefined}
 `;
 
killedBy: All tests
statusReason: > strykerAsyncApp@0.0.1 test
> jest --maxWorkers=50%



react-native/jest/preprocessor.js is deprecated and will be removed.
Use "preset": "react-native" in your Jest config instead.
See https://jestjs.io/docs/tutorial-react-native for more setup instructions.
